#ifndef __AR_INSTRUCT_WORD_H__
#define __AR_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_AR
//=================阿拉伯语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_AR \
    "أغلق","أطفئ","أوقف","اخرج","أغلق المحادثة","أوقف الحوار", \
    "انهِ الدردشة","لا أريد التحدث معك بعد الآن"

#define SYS_STR_POWER_OFF_AR \
    "أطفئ الجهاز"

#define SYS_30MIN_AR \
    "بعد ساعة ونصف","بعد ثلاثون دقيقة", \
    "بعد نصف ساعة","خلال ساعة ونصف", \
    "خلال ثلاثون دقيقة","خلال نصف ساعة"

#define SYS_90MIN_AR \
    "بعد ساعة ونصف","خلال ساعة ونصف"

#define SYS_HOUR_TIMEOUT_AR \
    "بعد ساعة","خلال ساعة"

#define SYS_MIN_TIMEOUT_AR \
    "بعد دقيقة","خلال بضع دقائق"

#define SYS_COUNTOWN_TIMEOUT_AR \
    "العد التنازلي","اضبط المؤقت"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_AR \
    "إلغاء العد التنازلي","احذف المؤقت","أوقف المؤقت"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_AR \
    "شغل الموسيقى","شغل الأغنية","تشغيل المقطع"

#define SYS_MUSIC_CONTINUE_AR \
    "استمر في التشغيل","أعد تشغيل الموسيقى","متابعة الأغنية"

#define SYS_MUSIC_STOP_AR \
    "أوقف مؤقتاً","أوقف الموسيقى مؤقتاً","إيقاف الأغنية مؤقتاً"

#define SYS_MUSIC_CLOSE_AR \
    "أوقف الموسيقى","أطفئ الموسيقى","إنهِ الأغنية"

#define SYS_MUSIC_NEXT_AR \
    "الأغنية التالية","المقطع التالي","غير الأغنية","تخطي الأغنية"

#define SYS_MUSIC_LAST_AR \
    "الأغنية السابقة","المقطع السابق"

#define SYS_MUSIC_LOOP_AR \
    "كرر أغنية واحدة فقط","وضع تكرار منفرد"

#define SYS_MUSIC_LOOP_CLOSE_AR \
    "إيقاف التكرار","الخروج من وضع التكرار","إلغاء التكرار", \
    "إيقاف تكرار أغنية واحدة"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_AR \
    "وضع الذكاء الاصطناعي","وضع مساعد ذكي"

#define SYS_MUSIC_APP_UDISK_AR \
    "شغل يو اس بي","وضع يو اس بي"

#define SYS_MUSIC_APP_SD_AR \
    "شغل بطاقة إس دي","شغل بطاقة تي إف","وضع إس دي","وضع تي إف"

#define SYS_MUSIC_APP_BT_AR \
    "وضع بلوتوث","تشغيل عبر بلوتوث"

#define SYS_MUSIC_APP_AUX_AR \
    "وضع مدخل الخط","وضع أوكس"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_AR \
    "احذف المنبه","إلغاء المنبه","أطفئ المنبه","احذف التذكير"

#define SYS_ALARM_DEL_ALL_AR \
    "احذف كل المنبهات","إلغاء كل المنبهات","أطفئ كل التذكيرات"

#define SYS_ALARM_LOOK_AR \
    "عرض المنبهات","ما هي المنبهات المضبوطة؟","افتح صفحة المنبهات"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_AR  "اضبط مستوى الصوت على"

#define SYS_MUSIC_VOLUME_AR \
    "خفض الصوت","اخفض صوت الموسيقى", \
    "ارفع الصوت","ارفع صوت الموسيقى"

#define SYS_MUSIC_MAX_VOLUME_AR \
    "أقصى مستوى صوت","الصوت على الحد الأقصى"

#define SYS_MUSIC_MIN_VOLUME_AR \
    "أدنى مستوى صوت","الصوت على الحد الأدنى"

#endif
#endif // __AR_INSTRUCT_WORD_H__