#ifndef __BN_INSTRUCT_WORD_H__
#define __BN_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_BN
//=================孟加拉语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_BN \
    "বন্ধ কর","বন্ধ করে দাও","থামো","চলে যাও","কথোপকথন বন্ধ কর", \
    "কথা বলা বন্ধ কর","কথোপকথন শেষ কর","তোমার সাথে কথা বলতে চাচ্ছি না"

#define SYS_STR_POWER_OFF_BN \
    "মেশিন বন্ধ কর"

#define SYS_30MIN_BN \
    "দেড় ঘন্টা পর","দেড় ঘন্টা পরে", \
    "ত্রিশ মিনিট পর","ত্রিশ মিনিট পরে", \
    "আধা ঘন্টা পর","আধা ঘন্টা পরে"

#define SYS_90MIN_BN \
    "দেড় ঘন্টা পর","দেড় ঘন্টা পরে"

#define SYS_HOUR_TIMEOUT_BN \
    "ঘন্টা পর","এক ঘন্টা পর"

#define SYS_MIN_TIMEOUT_BN \
    "মিনিট পর","কয়েক মিনিট পর"

#define SYS_COUNTOWN_TIMEOUT_BN \
    "উল্টো গণনা","টাইমার চালু কর"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_BN \
    "উল্টো গণনা বাতিল কর","টাইমার বন্ধ কর","টাইমার মুছে ফেল"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_BN \
    "গান চালাও","সঙ্গীত চালাও","গান বাজাও"

#define SYS_MUSIC_CONTINUE_BN \
    "চালিয়ে যাও","গান চালিয়ে যাও","সঙ্গীত চালিয়ে যাও"

#define SYS_MUSIC_STOP_BN \
    "ক্ষণিকের জন্য থামাও","গান ক্ষণিকের জন্য বন্ধ কর"

#define SYS_MUSIC_CLOSE_BN \
    "গান বন্ধ কর","সঙ্গীত বন্ধ কর","গান থামিয়ে দাও"

#define SYS_MUSIC_NEXT_BN \
    "পরের গান","গান পরিবর্তন কর","পরের গান চালাও","গান এড়িয়ে যাও"

#define SYS_MUSIC_LAST_BN \
    "আগের গান","আগের গান চালাও"

#define SYS_MUSIC_LOOP_BN \
    "একই গান বারবার চালাও"

#define SYS_MUSIC_LOOP_CLOSE_BN \
    "পুনরাবৃত্তি বন্ধ কর","লুপ মোড বন্ধ কর","পুনরাবৃত্তি বাতিল কর", \
    "এক গানের পুনরাবৃত্তি বন্ধ কর"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_BN \
    "AI মোড","স্মার্ট AI মোড","স্মার্ট সহকারী মোড"

#define SYS_MUSIC_APP_UDISK_BN \
    "USB চালাও","USB মোড"

#define SYS_MUSIC_APP_SD_BN \
    "SD কার্ড চালাও","TF কার্ড চালাও","SD কার্ড মোড","TF কার্ড মোড"

#define SYS_MUSIC_APP_BT_BN \
    "ব্লুটুথ মোড","ব্লুটুথ দিয়ে চালাও"

#define SYS_MUSIC_APP_AUX_BN \
    "লাইন মোড","অক্স ইনপুট মোড"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_BN \
    "অ্যালার্ম মুছে ফেল","অ্যালার্ম বাতিল কর","অ্যালার্ম বন্ধ কর","রিমাইন্ডার বাতিল কর"

#define SYS_ALARM_DEL_ALL_BN \
    "সব অ্যালার্ম মুছে ফেল","সব অ্যালার্ম বাতিল কর","সব অ্যালার্ম বন্ধ কর"

#define SYS_ALARM_LOOK_BN \
    "অ্যালার্ম দেখুন","কোন কোন অ্যালার্ম আছে","অ্যালার্ম পৃষ্ঠা খুলুন"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_BN  "শব্দের মাত্রা সেট কর"

#define SYS_MUSIC_VOLUME_BN \
    "শব্দ কম কর","গানের শব্দ কম কর", \
    "শব্দ বাড়াও","গানের শব্দ বাড়াও"

#define SYS_MUSIC_MAX_VOLUME_BN \
    "সর্বোচ্চ শব্দ","সবচেয়ে বেশি শব্দ","সর্বোচ্চ ভলিউম"

#define SYS_MUSIC_MIN_VOLUME_BN \
    "সর্বনিম্ন শব্দ","সবচেয়ে কম শব্দ","সর্বনিম্ন ভলিউম"

#endif
#endif // __BN_INSTRUCT_WORD_H__