#ifndef __FA_INSTRUCT_WORD_H__
#define __FA_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_FA
//=================波斯语(法尔西语)指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_FA \
    "بستن","خاموش کردن","متوقف کردن","خروج","بستن گفتگو","متوقف کردن مکالمه", \
    "پایان دادن به صحبت","دیگر نمی‌خواهم با تو صحبت کنم"

#define SYS_STR_POWER_OFF_FA \
    "دستگاه را خاموش کن"

#define SYS_30MIN_FA \
    "یک ساعت و نیم بعد","بعد از یک ساعت و نیم", \
    "سی دقیقه بعد","بعد از سی دقیقه", \
    "نیم ساعت بعد","بعد از نیم ساعت"

#define SYS_90MIN_FA \
    "یک ساعت و نیم بعد","بعد از یک ساعت و نیم"

#define SYS_HOUR_TIMEOUT_FA \
    "یک ساعت بعد","بعد از یک ساعت"

#define SYS_MIN_TIMEOUT_FA \
    "یک دقیقه بعد","بعد از چند دقیقه"

#define SYS_COUNTOWN_TIMEOUT_FA \
    "شمارش معکوس","تنظیم تایمر"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_FA \
    "لغو شمارش معکوس","حذف تایمر","خاموش کردن تایمر"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_FA \
    "پخش موسیقی","پخش آهنگ","اجرای ترانه"

#define SYS_MUSIC_CONTINUE_FA \
    "ادامه پخش","از سر گرفتن موسیقی","ادامه آهنگ"

#define SYS_MUSIC_STOP_FA \
    "مکث کردن","مکث موسیقی","مکث آهنگ"

#define SYS_MUSIC_CLOSE_FA \
    "متوقف کردن موسیقی","خاموش کردن موسیقی","پایان دادن به آهنگ"

#define SYS_MUSIC_NEXT_FA \
    "آهنگ بعدی","تراک بعدی","تغییر آهنگ","رد کردن آهنگ"

#define SYS_MUSIC_LAST_FA \
    "آهنگ قبلی","تراک قبلی"

#define SYS_MUSIC_LOOP_FA \
    "تکرار فقط یک آهنگ","حالت تکرار تک تراک"

#define SYS_MUSIC_LOOP_CLOSE_FA \
    "غیرفعال کردن تکرار","خروج از حالت تکرار","لغو تکرار", \
    "غیرفعال کردن تکرار یک آهنگ"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_FA \
    "حالت هوش مصنوعی","حالت دستیار هوشمند"

#define SYS_MUSIC_APP_UDISK_FA \
    "پخش یو اس بی","حالت یو اس بی"

#define SYS_MUSIC_APP_SD_FA \
    "پخش کارت اس دی","پخش کارت تی اف","حالت اس دی","حالت تی اف"

#define SYS_MUSIC_APP_BT_FA \
    "حالت بلوتوث","پخش از طریق بلوتوث"

#define SYS_MUSIC_APP_AUX_FA \
    "حالت ورودی خط","حالت اوکس"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_FA \
    "حذف زنگ هشدار","لغو زنگ هشدار","خاموش کردن زنگ هشدار","حذف یادآور"

#define SYS_ALARM_DEL_ALL_FA \
    "حذف تمام زنگ‌های هشدار","لغو تمام زنگ‌ها","خاموش کردن همه یادآورها"

#define SYS_ALARM_LOOK_FA \
    "مشاهده زنگ‌ها","چه زنگ‌هایی تنظیم شده؟","باز کردن صفحه زنگ هشدار"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_FA  "تنظیم میزان صدا روی"

#define SYS_MUSIC_VOLUME_FA \
    "کم کردن صدا","کم کردن صدای موسیقی", \
    "زیاد کردن صدا","زیاد کردن صدای موسیقی"

#define SYS_MUSIC_MAX_VOLUME_FA \
    "حداکثر میزان صدا","صدا در حداکثر حالت"

#define SYS_MUSIC_MIN_VOLUME_FA \
    "حداقل میزان صدا","صدا در حداقل حالت"

#endif
#endif // __FA_INSTRUCT_WORD_H__