#ifndef __KM_INSTRUCT_WORD_H__
#define __KM_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_KM
//=================高棉语(柬埔寨)指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_KM \
    "បិទ","បិទហើយ","ឈប់","ចាកចេញ","បិទការសន្ទនា","ឈប់សន្ទនា", \
    "បញ្ចប់ការសន្ទនា","មិនចង់និយាយជាមួយអ្នកទៀត"

#define SYS_STR_POWER_OFF_KM \
    "បិទឧបករណ៍"

#define SYS_30MIN_KM \
    "មួយម៉ោងកន្លះក្រោយ","មួយម៉ោងកន្លះក្រោយពេលនេះ", \
    "សាមសិបនាទីក្រោយ","សាមសិបនាទីក្រោយពេលនេះ", \
    "កន្លះម៉ោងក្រោយ","កន្លះម៉ោងក្រោយពេលនេះ"

#define SYS_90MIN_KM \
    "មួយម៉ោងកន្លះក្រោយ","មួយម៉ោងកន្លះក្រោយពេលនេះ"

#define SYS_HOUR_TIMEOUT_KM \
    "ម៉ោងក្រោយ","ម៉ោងក្រោយពេលនេះ"

#define SYS_MIN_TIMEOUT_KM \
    "នាទីក្រោយ","នាទីក្រោយពេលនេះ"

#define SYS_COUNTOWN_TIMEOUT_KM \
    "រាប់ថយក្រោយ","កំណត់ម៉ោងរាប់"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_KM \
    "បោះបង់ការរាប់ថយក្រោយ","លុបការកំណត់ម៉ោង","បោះបង់ការកំណត់ម៉ោង"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_KM \
    "បើកចម្រៀង","បើកតន្ត្រី","ចាក់ចម្រៀង"

#define SYS_MUSIC_CONTINUE_KM \
    "បន្តចាក់","បន្តបើកចម្រៀង","បន្តតន្ត្រី"

#define SYS_MUSIC_STOP_KM \
    "ឈប់បណ្តោះអាសន្ន","ឈប់ចាក់ចម្រៀងបណ្តោះអាសន្ន"

#define SYS_MUSIC_CLOSE_KM \
    "ឈប់ចាក់ចម្រៀង","បិទតន្ត្រី","ឈប់តន្ត្រី","បិទចម្រៀង"

#define SYS_MUSIC_NEXT_KM \
    "ចម្រៀងបន្ទាប់","ប្តូរចម្រៀង","ចាក់ចម្រៀងបន្ទាប់","រំលងចម្រៀង"

#define SYS_MUSIC_LAST_KM \
    "ចម្រៀងមុន","ចាក់ចម្រៀងមុន"

#define SYS_MUSIC_LOOP_KM \
    "ចាក់ឡើងវិញចម្រៀងតែមួយ"

#define SYS_MUSIC_LOOP_CLOSE_KM \
    "បិទការចាក់ឡើងវិញ","ចាកចេញពីរបៀបចាក់ឡើងវិញ","បោះបង់ការចាក់ឡើងវិញ", \
    "បិទការចាក់ឡើងវិញចម្រៀងតែមួយ"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_KM \
    "របៀប AI","របៀបឆ្លាតវៃ AI","របៀបភ្នាក់ងារឆ្លាតវៃ"

#define SYS_MUSIC_APP_UDISK_KM \
    "បើក USB flash drive","របៀប USB"

#define SYS_MUSIC_APP_SD_KM \
    "បើកកាត SD","បើកកាត TF","របៀបកាត SD","របៀបកាត TF"

#define SYS_MUSIC_APP_BT_KM \
    "របៀបប៊្លូធូស","បើកតាមប៊្លូធូស"

#define SYS_MUSIC_APP_AUX_KM \
    "របៀបខ្សែអូឌីយ៉ូ","របៀបបញ្ចូលខ្សែអូឌីយ៉ូ"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_KM \
    "លុបនាឡិការោទិ៍","បោះបង់នាឡិការោទិ៍","បិទនាឡិការោទិ៍","បោះបង់ការជូនដំណឹង"

#define SYS_ALARM_DEL_ALL_KM \
    "លុបនាឡិការោទិ៍ទាំងអស់","បោះបង់នាឡិការោទិ៍ទាំងអស់","បិទនាឡិការោទិ៍ទាំងអស់"

#define SYS_ALARM_LOOK_KM \
    "មើលនាឡិការោទិ៍","មាននាឡិការោទិ៍អ្វីខ្លះ","ចូលអេក្រង់នាឡិការោទិ៍"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_KM  "កំណត់កម្រិតសម្លេងជា"

#define SYS_MUSIC_VOLUME_KM \
    "សម្លេងតិចបន្តិច","បន្ថយសម្លេងចម្រៀង","បន្ថយកម្រិតសម្លេង", \
    "សម្លេងខ្លាំងបន្តិច","បង្កើនសម្លេងចម្រៀង","បង្កើនកម្រិតសម្លេង"

#define SYS_MUSIC_MAX_VOLUME_KM \
    "សម្លេងខ្លាំងបំផុត","កម្រិតសម្លេងខ្ពស់បំផុត"

#define SYS_MUSIC_MIN_VOLUME_KM \
    "សម្លេងតិចបំផុត","កម្រិតសម្លេងទាបបំផុត"

#endif
#endif // __KM_INSTRUCT_WORD_H__