#ifndef __LO_INSTRUCT_WORD_H__
#define __LO_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_LO
//=================老挝语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_LO \
    "ປິດ","ປິດແລ້ວ","ຢຸດ","ອອກໄປ","ປິດການສົນທະນາ","ຢຸດສົນທະນາ", \
    "ສິ້ນສຸດການສົນທະນາ","ບໍ່ຢາກລົມນຳເຈົ້າແລ້ວ"

#define SYS_STR_POWER_OFF_LO \
    "ປິດເຄື່ອງ"

#define SYS_30MIN_LO \
    "ໜຶ່ງຊົ່ວໂມງເຄິ່ງຕໍ່ໄປ","ໜຶ່ງຊົ່ວໂມງເຄິ່ງຫຼັງຈາກນີ້", \
    "ສາມສິບນາທີຕໍ່ໄປ","ສາມສິບນາທີຫຼັງຈາກນີ້", \
    "ເຄິ່ງຊົ່ວໂມງຕໍ່ໄປ","ເຄິ່ງຊົ່ວໂມງຫຼັງຈາກນີ້"

#define SYS_90MIN_LO \
    "ໜຶ່ງຊົ່ວໂມງເຄິ່ງຕໍ່ໄປ","ໜຶ່ງຊົ່ວໂມງເຄິ່ງຫຼັງຈາກນີ້"

#define SYS_HOUR_TIMEOUT_LO \
    "ຊົ່ວໂມງຕໍ່ໄປ","ຊົ່ວໂມງຫຼັງຈາກນີ້"

#define SYS_MIN_TIMEOUT_LO \
    "ນາທີຕໍ່ໄປ","ນາທີຫຼັງຈາກນີ້"

#define SYS_COUNTOWN_TIMEOUT_LO \
    "ນັບຖອຍຫຼັງ","ຕັ້ງເວລານັບ"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_LO \
    "ຍົກເລີກນັບຖອຍຫຼັງ","ລົບການຕັ້ງເວລາ","ຍົກເລີກຕັ້ງເວລາ"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_LO \
    "ເປີດເພງ","ເປີດດົນຕີ","ຫຼິ້ນເພງ"

#define SYS_MUSIC_CONTINUE_LO \
    "ສືບຕໍ່ຫຼິ້ນ","ສືບຕໍ່ເປີດເພງ","ສືບຕໍ່ດົນຕີ"

#define SYS_MUSIC_STOP_LO \
    "ຢຸດຊົ່ວຄາວ","ຢຸດເປີດເພງຊົ່ວຄາວ"

#define SYS_MUSIC_CLOSE_LO \
    "ຢຸດຫຼິ້ນເພງ","ປິດດົນຕີ","ຢຸດດົນຕີ","ປິດເພງ"

#define SYS_MUSIC_NEXT_LO \
    "ເພງຕໍ່ໄປ","ປ່ຽນເພງ","ຫຼິ້ນເພງຕໍ່ໄປ","ຂ້າມເພງ"

#define SYS_MUSIC_LAST_LO \
    "ເພງກ່ອນໜ້າ","ຫຼິ້ນເພງກ່ອນໜ້າ"

#define SYS_MUSIC_LOOP_LO \
    "ຫຼິ້ນຊ້ຳເພງດຽວ"

#define SYS_MUSIC_LOOP_CLOSE_LO \
    "ປິດການຫຼິ້ນຊ້ຳ","ອອກຈາກໂໝດຊ້ຳ","ຍົກເລີກຫຼິ້ນຊ້ຳ", \
    "ປິດຫຼິ້ນຊ້ຳເພງດຽວ"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_LO \
    "ໂໝດ AI","ໂໝດອັດສະລິຍະ AI","ໂໝດຕົວແທນອັດສະລິຍະ"

#define SYS_MUSIC_APP_UDISK_LO \
    "ເປີດ USB flash drive","ໂໝດ USB"

#define SYS_MUSIC_APP_SD_LO \
    "ເປີດບັດ SD","ເປີດບັດ TF","ໂໝດ SD card","ໂໝດ TF card"

#define SYS_MUSIC_APP_BT_LO \
    "ໂໝດບລູທູດ","ເປີດຜ່ານບລູທູດ"

#define SYS_MUSIC_APP_AUX_LO \
    "ໂໝດສາຍສຽງ","ໂໝດປ້ອນສາຍສຽງ"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_LO \
    "ລົບໂມງປຸກ","ຍົກເລີກໂມງປຸກ","ປິດໂມງປຸກ","ຍົກເລີກການເຕືອນ"

#define SYS_ALARM_DEL_ALL_LO \
    "ລົບໂມງປຸກທັງໝົດ","ຍົກເລີກໂມງປຸກທັງໝົດ","ປິດໂມງປຸກທັງໝົດ"

#define SYS_ALARM_LOOK_LO \
    "ເບິ່ງໂມງປຸກ","ມີໂມງປຸກຫຍັງແດ່","ເຂົ້າໜ້າຈໍໂມງປຸກ"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_LO  "ຕັ້ງລະດັບສຽງເປັນ"

#define SYS_MUSIC_VOLUME_LO \
    "ສຽງນ້ອຍໜຶ່ງໜ່ວຍ","ຫຼຸດສຽງເພງ","ຫຼຸດລະດັບສຽງ", \
    "ສຽງດັງໜຶ່ງໜ່ວຍ","ເພີ່ມສຽງເພງ","ເພີ່ມລະດັບສຽງ"

#define SYS_MUSIC_MAX_VOLUME_LO \
    "ສຽງດັງສຸດ","ລະດັບສຽງສູງສຸດ","ສຽງດັງທີ່ສຸດ"

#define SYS_MUSIC_MIN_VOLUME_LO \
    "ສຽງນ້ອຍສຸດ","ລະດັບສຽງຕໍ່າສຸດ","ສຽງອ່ອນທີ່ສຸດ"

#endif
#endif // __LO_INSTRUCT_WORD_H__