#ifndef __MY_INSTRUCT_WORD_H__
#define __MY_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_MY
//=================缅甸语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_MY \
    "ပိတ်","ပိတ်လိုက်","ရပ်လိုက်","ထွက်ပါ","စကားပြောမှုပိတ်","စကားပြောမှုပိတ်လိုက်","စကားပြောရပ်","စကားပြောမှုရပ်လိုက်", \
    "စကားပြောအဆုံးသတ်","မင်းနဲ့မပြောချင်တော့ဘူး","မင်းနဲ့စကားမပြောချင်တော့ဘူး"

#define SYS_STR_POWER_OFF_MY \
    "စက်ပိတ်"

#define SYS_30MIN_MY \
    "တစ်နာရီခွဲကြာရင်","တစ်နာရီခွဲနောက်မှာ","တစ်နာရီခွဲပြီးရင်", \
    "မိနစ်သုံးဆယ်ကြာရင်","မိနစ်သုံးဆယ်နောက်မှာ","မိနစ်သုံးဆယ်ပြီးရင်", \
    "ခွဲနာရီကြာရင်","ခွဲနာရီနောက်မှာ","ခွဲနာရီပြီးရင်"

#define SYS_90MIN_MY \
    "တစ်နာရီခွဲကြာရင်","တစ်နာရီခွဲနောက်မှာ","တစ်နာရီခွဲပြီးရင်"

#define SYS_HOUR_TIMEOUT_MY \
    "နာရီကြာရင်","နာရီနောက်မှာ","နာရီပြီးရင်"

#define SYS_MIN_TIMEOUT_MY \
    "မိနစ်ကြာရင်","မိနစ်နောက်မှာ","မိနစ်ပြီးရင်"

#define SYS_COUNTOWN_TIMEOUT_MY \
    "အချိန်ရေတွက်","အချိန်တိုင်းတာ"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_MY \
    "အချိန်ရေတွက်ဖျက်","အချိန်ရေတွက်ပယ်","အချိန်တိုင်းတာဖျက်","အချိန်တိုင်းတာပယ်"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_MY \
    "ဖွင့်ပါ","သီချင်းဖွင့်","ဂီတဖွင့်"

#define SYS_MUSIC_CONTINUE_MY \
    "ဆက်ဖွင့်ပါ","သီချင်းဆက်ဖွင့်","ဂီတဆက်ဖွင့်"

#define SYS_MUSIC_STOP_MY \
    "ခေတ္တရပ်","ခေတ္တရပ်ဖွင့်မှု","ဂီတခေတ္တရပ်"

#define SYS_MUSIC_CLOSE_MY \
    "သီချင်းရပ်","ဖွင့်မှုရပ်","ဂီတရပ်","ဂီတပိတ်","သီချင်းပိတ်"

#define SYS_MUSIC_NEXT_MY \
    "နောက်သီချင်း","နောက်သီချင်းဖွင့်","သီချင်းလဲ","ဂီတလဲ","သီချင်းကူး"

#define SYS_MUSIC_LAST_MY \
    "ရှေ့သီချင်း","ရှေ့သီချင်းဖွင့်","ရှေ့ဂီတဖွင့်"

#define SYS_MUSIC_LOOP_MY \
    "တစ်သီချင်းထပ်ဖွင့်ခြင်း"

#define SYS_MUSIC_LOOP_CLOSE_MY \
    "ထပ်ဖွင့်မှုပိတ်","ထပ်ဖွင့်မှုထွက်","ထပ်ဖွင့်မှုပယ်", \
    "တစ်သီချင်းထပ်ဖွင့်ပိတ်","တစ်သီချင်းထပ်ဖွင့်ထွက်","တစ်သီချင်းထပ်ဖွင့်ပယ်"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_MY \
    "AI မုဒ်","AI စမတ်မုဒ်","စမတ်ကိုယ်စားလှယ်မုဒ်"

#define SYS_MUSIC_APP_UDISK_MY \
    "USB ဖွင့်","USB မုဒ်","USB ဖွင့်မုဒ်"

#define SYS_MUSIC_APP_SD_MY \
    "SD ကဒ်ဖွင့်","TF ကဒ်ဖွင့်","SD ကဒ်မုဒ်","TF ကဒ်မုဒ်", \
    "SD ကဒ်ဖွင့်မုဒ်","TF ကဒ်ဖွင့်မုဒ်"

#define SYS_MUSIC_APP_BT_MY \
    "ဘလူးတုသ်ဖွင့်","ဘလူးတုသ်မုဒ်","ဘလူးတုသ်ဖွင့်မုဒ်"

#define SYS_MUSIC_APP_AUX_MY \
    "လိုင်းမုဒ်","လိုင်းထည့်သွင်းမုဒ်"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_MY \
    "နှိုးစက်ဖျက်","နှိုးစက်ပယ်","သတိပေးချက်ပယ်","နှိုးစက်ပိတ်"

#define SYS_ALARM_DEL_ALL_MY \
    "အားလုံးနှိုးစက်ဖျက်","အားလုံးနှိုးစက်ပယ်","အားလုံးသတိပေးချက်ပယ်","အားလုံးနှိုးစက်ပိတ်"

#define SYS_ALARM_LOOK_MY \
    "နှိုးစက်ကြည့်","နှိုးစက်တွေဘာတွေရှိလဲ","နှိုးစက်မျက်နှာပြင်","နှိုးစက်မျက်နှာပြင်ဝင်"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_MY  "အသံပမာဏကိုထားပါ"

#define SYS_MUSIC_VOLUME_MY \
    "အသံနည်းနည်းလျှော့","သီချင်းအသံလျှော့","အသံလျှော့", \
    "အသံနည်းနည်းမြင့်","သီချင်းအသံမြင့်","အသံမြင့်"

#define SYS_MUSIC_MAX_VOLUME_MY \
    "အမြင့်ဆုံးအသံပမာဏ","အများဆုံးအသံ","အသံအများဆုံး","အသံအမြင့်ဆုံး"

#define SYS_MUSIC_MIN_VOLUME_MY \
    "အနည်းဆုံးအသံပမာဏ","အနည်းဆုံးအသံ","အသံအနည်းဆုံး","အသံအနိမ့်ဆုံး"

#endif
#endif // __MY_INSTRUCT_WORD_H__