#ifndef __RU_INSTRUCT_WORD_H__
#define __RU_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_RU
//=================俄语指令词=====================//

//=================System Instructions=====================//
#define SYS_CLOSE_RU \
    "Закрыл","Закрыть","Выключить","Остановлено","Отступить","Разговор закрыт","Разговор завершён","Закрыть разговор","Прекратить разговор","Разговор остановлен", \
    "Завершить разговор","Выключить разговор","Убирайся","Не хочу с тобой говорить","Больше не хочу с тобой разговаривать", \
    "Закрыто","отключено","выключено","остановлено","уходя","диалог закрыт","диалог отключен", \
    " закрыть диалог","диалог остановлен","завершить диалог","Конец разговора","Я больше не хочу с тобой разговаривать", \
    "Конец разговора", \
    "system_exit","system exit", \
    "System_exit","System exit"

#define SYS_STR_POWER_OFF_RU \
    "Выключить"

#define SYS_30MIN_RU \
    "Через полчаса"

#define SYS_90MIN_RU \
    "Через полтора часа"

#define SYS_HOUR_TIMEOUT_RU \
    "через несколько часов"

#define SYS_MIN_TIMEOUT_RU \
    "через несколько минут"

#define SYS_COUNTOWN_TIMEOUT_RU \
    "обратный отсчёт"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_RU \
    "Отменить таймер","Удалить таймер","Отменить обратный отсчет","Удалить обратный отсчет"

//=================Music Instructions=====================//
#define SYS_MUSIC_PLAY_RU \
    "Воспроизвести","Воспроизвести песню","Воспроизвести музыку", \
    "Включите музыку"

#define SYS_MUSIC_CONTINUE_RU \
    "Продолжить воспроизведение","Продолжить проигрывание песни", \
    "Продолжить воспроизведение музыки", \
    "music_resume","music resume", \
    "Music_resume","Music resume"

#define SYS_MUSIC_STOP_RU \
    "Пауза","Приостановить воспроизведение", \
    "Приостановить воспроизведение музыки", \
    "music_pause","music pause", \
    "Music_pause","Music pause"

#define SYS_MUSIC_CLOSE_RU \
    "music_stop","music stop", \
    "Music_stop","Music stop", \
    "Прекратить воспроизведение музыки", \
    "Остановить воспроизведение", \
    "Остановить воспроизведение музыки", \
    "Выключить музыку", \
    "Музыка выключена", \
    "Остановить песню", \
    "Песня выключена", \
    "Выключите музыку", \
    "выключите музыку"

#define SYS_MUSIC_NEXT_RU \
    "music_next_track","music next track", \
    "Music_next_track","Music next track", \
    "Следующая песня","Воспроизвести следующую песню", \
    "Поменять песню","Поменять музыку","пропустить песню", \
    "Воспроизвести следующую песню"

#define SYS_MUSIC_LAST_RU \
    "music_previous_track","music previous track", \
    "Music_previous_track","Music previous track", \
    "Предыдущая песня","Воспроизвести предыдущую песню", \
    "Воспроизвести предыдущую песню"

#define SYS_MUSIC_LOOP_RU \
    "music_loop_single","music loop single", \
    "Music_loop_single","Music loop single", \
    "Повтор песни","Повторение сингла","включите музыку на повтор", \
    "Пожалуйста, включите музыку на повтор", \
    "Пожалуйста включите музыку на повтор"

#define SYS_MUSIC_LOOP_CLOSE_RU \
    "Отключить цикл","выйти из цикла","Отменить цикл", \
    "Выключить повтор одной песни","Выход из режима повтора одной песни", \
    "Отмените музыку на повтор", \
    "Пожалуйста, Отмените музыку на повтор", \
    "Пожалуйста, отмените музыку на повтор"

//=================Device Control Instructions=====================//
#define SYS_MUSIC_APP_AI_RU \
    "Режим ИИ","Режим агента","Режим ИИ-агента"

#define SYS_MUSIC_APP_UDISK_RU \
    "source_usb","source usb", \
    "Source_usb","Source usb", \
    "Воспроизвести USB-накопитель", \
    "Режим воспроизведения с USB-накопителя", \
    "Режим USB-накопителя"

#define SYS_MUSIC_APP_SD_RU \
    "source_sdcard","source sdcard", \
    "Source_sdcard","Source sdcard", \
    "Воспроизведение с SD-карты","Воспроизведение с TF-карты", \
    "Режим воспроизведения SD-карты","Режим SD-карты", \
    "Режим воспроизведения SD-карты"

#define SYS_MUSIC_APP_BT_RU \
    "Play Bluetooth","Bluetooth mode","Bluetooth play mode", \
    "play Bluetooth","bluetooth mode","bluetooth play mode", \
    "Воспроизведение через Bluetooth","Режим Bluetooth","Режим воспроизведения по Bluetooth", \
    "Воспроизвести блютуз","Воспроизвести Bluetooth"

#define SYS_MUSIC_APP_AUX_RU \
    "Проводной режим","Режим входа линии","Режим входа в линию"

//=================Alarm Instructions=====================//
#define SYS_ALARM_DEL_RU \
    "Удалить будильник","Отменить будильник","Отменить напоминание","Выключить будильник"

#define SYS_ALARM_DEL_ALL_RU \
    "Удалить все будильники","Отменить все будильники", \
    "Отменить все напоминания","Выключить все будильники", \
    "Отключить все будильники","Отключите все будильник", \
    "Отключите все будильники"

#define SYS_ALARM_LOOK_RU \
    "Просмотреть будильник","Какие будильники есть", \
    "страница будильника","Перейти на страницу будильника", \
    "Просмотреть страницу будильника"

//=================Volume Control Instructions=====================//
#define SYS_VOLUME_SET_RU  "volume_set_"

#define SYS_MUSIC_VOLUME_RU \
    "Убавьте громкость","Музыку немного тихо","Громкость понижена","Уменьшить громкость", \
    "Увеличьте громкость","Музыка, пожалуйста, громче","Увеличить громкость"

#define SYS_MUSIC_MAX_VOLUME_RU \
    "Максимальная громкость","максимальная громкость","максимальный звук", \
    "самый высокий голос","самый громкий звук","Максимальный громкость", \
    "Максимальный звук","Наибольший звук","Громкий голос", \
    "Самый высокий звук","Увеличьте громкость до максимума"

#define SYS_MUSIC_MIN_VOLUME_RU \
    "Минимальная громкость","минимальный звук","самый тихий звук", \
    "Звук минимальный","Минимальный громкость","Минимальный звук", \
    "Убавьте громкость до минимума"

#endif // CONFIG_KWS_ENGLISH

#endif // __RU_INSTRUCT_WORD_H__
