#ifndef __TE_INSTRUCT_WORD_H__
#define __TE_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_TE
//=================泰卢固语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_TE \
    "మూసేయి","ఆపు","బయటకు రండి","సంభాషణను ముగించు","సంభాషణను ఆపు", \
    "డైలాగ్ మూసేయి","నీతో మాట్లాడాలని ఇష్టం లేదు"

#define SYS_STR_POWER_OFF_TE \
    "పరికరాన్ని మూసేయి"

#define SYS_30MIN_TE \
    "ఒకటిన్నర గంట తరువాత","ఒకటిన్నర గంట తర్వాత", \
    "ముప్పై నిమిషాల తరువాత","ముప్పై నిమిషాల తర్వాత", \
    "అరగంట తరువాత","అరగంట తర్వాత"

#define SYS_90MIN_TE \
    "ఒకటిన్నర గంట తరువాత","ఒకటిన్నర గంట తర్వాత"

#define SYS_HOUR_TIMEOUT_TE \
    "గంట తరువాత","ఒక గంట తర్వాత"

#define SYS_MIN_TIMEOUT_TE \
    "నిమిషం తరువాత","కొన్ని నిమిషాల తర్వాత"

#define SYS_COUNTOWN_TIMEOUT_TE \
    "రివర్స్ కౌంటింగ్","టైమర్ సెట్ చేయి"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_TE \
    "రివర్స్ కౌంటింగ్ రద్దు చేయి","టైమర్ తొలగించు","టైమర్ మూసేయి"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_TE \
    "పాట ప్లే చేయి","సంగీతం వాయించు","పాట వేయి"

#define SYS_MUSIC_CONTINUE_TE \
    "కొనసాగించు","పాటను కొనసాగించు","సంగీతాన్ని కొనసాగించు"

#define SYS_MUSIC_STOP_TE \
    "తాత్కాలికంగా ఆపు","పాటను పాజ్ చేయి"

#define SYS_MUSIC_CLOSE_TE \
    "పాటను ఆపు","సంగీతాన్ని మూసేయి"

#define SYS_MUSIC_NEXT_TE \
    "తదుపరి పాట","పాట మార్చు","పాట దాటవేయి"

#define SYS_MUSIC_LAST_TE \
    "మునుపటి పాట","మునుపటి పాట వాయించు"

#define SYS_MUSIC_LOOP_TE \
    "ఒకే పాటను పదే పదే వాయించు","సింగిల్ లూప్ మోడ్"

#define SYS_MUSIC_LOOP_CLOSE_TE \
    "రిపీట్ మోడ్ మూసేయి","లూప్ మోడ్ నుండి బయటకు రండి","రిపీట్ రద్దు చేయి", \
    "ఒక పాట రిపీట్ మోడ్ ఆపు"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_TE \
    "AI మోడ్","స్మార్ట్ AI మోడ్","సహాయక మోడ్"

#define SYS_MUSIC_APP_UDISK_TE \
    "USB ప్లే చేయి","USB మోడ్"

#define SYS_MUSIC_APP_SD_TE \
    "SD కార్డ్ ప్లే చేయి","TF కార్డ్ ప్లే చేయి","SD మోడ్","TF మోడ్"

#define SYS_MUSIC_APP_BT_TE \
    "బ్లూటూత్ మోడ్","బ్లూటూత్ ద్వారా ప్లే చేయి"

#define SYS_MUSIC_APP_AUX_TE \
    "లైన్ ఇన్ మోడ్","ఆక్స్ మోడ్"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_TE \
    "అలారం తొలగించు","అలారం రద్దు చేయి","అలారం మూసేయి","రిమైండర్ తొలగించు"

#define SYS_ALARM_DEL_ALL_TE \
    "అన్ని అలారాలను తొలగించు","అన్ని అలారాలను రద్దు చేయి","అన్ని రిమైండర్లను మూసేయి"

#define SYS_ALARM_LOOK_TE \
    "అలారాలను చూడు","ఏ ఏ అలారాలు సెట్ అయ్యాయి","అలారం పేజీ తెరువు"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_TE  "ధ్వని స్థాయి సెట్ చేయి"

#define SYS_MUSIC_VOLUME_TE \
    "ధ్వని తగ్గించు","పాట ధ్వని తగ్గించు", \
    "ధ్వని పెంచు","పాట ధ్వని పెంచు"

#define SYS_MUSIC_MAX_VOLUME_TE \
    "గరిష్ట ధ్వని","అత్యధిక ధ్వని స్థాయి"

#define SYS_MUSIC_MIN_VOLUME_TE \
    "కనిష్ట ధ్వని","అత్యల్ప ధ్వని స్థాయి"

#endif
#endif // __TE_INSTRUCT_WORD_H__
