#ifndef __TH_INSTRUCT_WORD_H__
#define __TH_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_TH

//=================泰语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_TH \
    "ปิด","ปิดมัน","ปิด","ปิดเครื่อง","ปิดเครื่อง","shutdown","หยุดมัน","หยุด","ลาไป","ขอโทษ" 

#define SYS_STR_POWER_OFF_TH \
    "ปิดเครื่อง"

#define SYS_30MIN_TH \
    "ครึ่งชั่วโมงต่อมา"

#define SYS_90MIN_TH \
    "หนึ่งชั่วโมงครึ่งหลังจากนั้น"

#define SYS_HOUR_TIMEOUT_TH \
    "หนึ่งชั่วโมงต่อมา"

#define SYS_MIN_TIMEOUT_TH \
    "หลังจากนั้นไม่กี่นาที"

#define SYS_COUNTOWN_TIMEOUT_TH \
    "นับถอยหลัง", \
    "การนับเวลา"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_TH \
    "ยกเลิกการนับเวลา","ลบการนับเวลา","ยกเลิกการนับถอยหลัง","ลบการนับถอยหลัง"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_TH \
    "เล่น","เล่นเพลง","เล่นเพลง"

#define SYS_MUSIC_CONTINUE_TH \
    "เล่นต่อ","เล่นเพลงต่อไป","เล่นเพลงต่อไป"

#define SYS_MUSIC_STOP_TH \
    "หยุดชั่วคราว","หยุดการเล่น","หยุดเล่นเพลง"

#define SYS_MUSIC_CLOSE_TH \
    "หยุดพากย์เพลง","หยุดการเล่น","หยุดเล่นเพลง","ปิดเพลง","เพลงหยุด","หยุดเสียงเพลง"

#define SYS_MUSIC_NEXT_TH \
    "เพลงต่อไป","เล่นเพลงถัดไป","เปลี่ยนเพลงหนึ่ง","ตัดเพลง","เปลี่ยนเพลง"

#define SYS_MUSIC_LAST_TH \
    "เพลงก่อนหน้า","เล่นเพลงก่อนหน้า"

#define SYS_MUSIC_LOOP_TH \
    "ซิงเกิลเลิกรีปท์","ซิงเกิลรีปต์"

#define SYS_MUSIC_LOOP_CLOSE_TH \
    "ปิดวงจร","ออกจากการวนลูป","ยกเลิกการหมุนเวียน", \
    "ปิดการเล่นซีรีส์เดี่ยว","ออกจากการเล่นซิงเกิลแบบวนเวียน","ยกเลิกการเล่นซ้ำเพลงเดี่ยว"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_TH \
    "โหมด AI","โหมด AI","รูปแบบของอัจฉริยะ AI", \
    "โหมดอัจฉริยะ"

#define SYS_MUSIC_APP_UDISK_TH \
    "เล่นแฟลชไดรฟ์","โหมดเล่นไฟล์บนแฟลชไดรฟ์","โหมดแฟลชไดรฟ์"

#define SYS_MUSIC_APP_SD_TH \
    "เล่นจากบัตร SD","เล่นการ์ด TF","โหมดเล่นการ์ด SD","โหมดเล่นการ์ด TF","โหมดการ์ด SD","โหมดการ์ด TF"

#define SYS_MUSIC_APP_BT_TH \
    "เล่นบลูทูธ","โหมดบลูทูธ","โหมดเล่นบลูทูธ"

#define SYS_MUSIC_APP_AUX_TH \
    "โหมดเส้นทาง","โหมดอินพุตสายเคเบิล"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_TH \
    "ลบนาฬิกาปลุก","ยกเลิกนาฬิกาปลุก","ยกเลิกการแจ้งเตือน","ปิดนาฬิกาปลุก"

#define SYS_ALARM_DEL_ALL_TH \
    "ลบนาฬิกาทั้งหมด","ยกเลิกนาฬิกาตื่นทั้งหมด","ยกเลิกการเตือนทั้งหมด","ปิดนาฬิกาเตือนทั้งหมด"

#define SYS_ALARM_LOOK_TH \
    "ดูนาฬิกาปลุก","มีนาฬิกาปลุกอะไรบ้าง","หน้านาฬิกาปลุก","เข้าสู่หน้านาฬิกาปลุก","ดูหน้านาฬิกาปลุก"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_TH     "ปรับเสียงให้ดังขึ้น"

#define SYS_MUSIC_VOLUME_TH \
    "พูดเบาหน่อย","เพลงให้พูดเบาหน่อย","ปรับเสียงให้ต่ำลง","ลดเสียง", \
    "พูดเสียงดังขึ้นหน่อย","เพลงให้ดังขึ้นหน่อย","ปรับเสียงให้ดังขึ้น","ปรับเสียงให้ใหญ่ขึ้น"

#define SYS_MUSIC_MAX_VOLUME_TH \
    "ระดับเสียงสูงสุด","เสียงสูงสุด","เสียงสูงที่สุด","เสียงดังที่สุด","เสียงที่ดังที่สุด","เสียงสูงสุด","เสียงดังที่สุด","เสียงสูงที่สุด"

#define SYS_MUSIC_MIN_VOLUME_TH \
    "ระดับเสียงต่ำที่สุด","ระดับเสียงต่ำสุด","ระดับเสียงต่ำที่สุด","ระดับเสียงต่ำที่สุด","เสียงที่น้อยที่สุด","เสียงต่ำสุด","เสียงเบาที่สุด","เสียงต่ำที่สุด"

#endif
#endif // __TH_INSTRUCT_WORD_H__
