#ifndef __UK_INSTRUCT_WORD_H__
#define __UK_INSTRUCT_WORD_H__

#ifdef CONFIG_INSTRUCTION_UK
//=================乌克兰语指令词=====================//

//=================系统指令=====================//
#define SYS_CLOSE_UK \
    "закрити","вимкнути","зупинити","вийти","закрити розмову","зупинити діалог", \
    "завершити спілкування","я більше не хочу з тобою розмовляти"

#define SYS_STR_POWER_OFF_UK \
    "вимкнути пристрій"

#define SYS_30MIN_UK \
    "півтори години пізніше","через півтори години", \
    "тридцять хвилин пізніше","через тридцять хвилин", \
    "півгодини пізніше","через півгодини"

#define SYS_90MIN_UK \
    "півтори години пізніше","через півтори години"

#define SYS_HOUR_TIMEOUT_UK \
    "годину пізніше","через годину"

#define SYS_MIN_TIMEOUT_UK \
    "хвилину пізніше","через кілька хвилин"

#define SYS_COUNTOWN_TIMEOUT_UK \
    "зворотний відлік","налаштувати таймер"

#define SYS_COUNTOWN_TIMEOUT_CLOSE_UK \
    "скасувати зворотний відлік","видалити таймер","вимкнути таймер"

//=================音乐指令=====================//
#define SYS_MUSIC_PLAY_UK \
    "відтворити музику","увімкнути пісню","грати музику"

#define SYS_MUSIC_CONTINUE_UK \
    "продовжити відтворення","відновити музику","продовжити пісню"

#define SYS_MUSIC_STOP_UK \
    "призупинити","призупинити музику","призупинити пісню"

#define SYS_MUSIC_CLOSE_UK \
    "зупинити музику","вимкнути музику","завершити пісню"

#define SYS_MUSIC_NEXT_UK \
    "наступна пісня","наступний трек","змінити пісню","пропустити пісню"

#define SYS_MUSIC_LAST_UK \
    "попередня пісня","попередній трек"

#define SYS_MUSIC_LOOP_UK \
    "повторювати одну пісню","режим повтору одного треку"

#define SYS_MUSIC_LOOP_CLOSE_UK \
    "вимкнути повтор","вийти з режиму повтору","скасувати повтор", \
    "вимкнути повтор однієї пісні"

//=================设备控制指令=====================//
#define SYS_MUSIC_APP_AI_UK \
    "режим ШІ","розумний режим ШІ","режим розумного помічника"

#define SYS_MUSIC_APP_UDISK_UK \
    "відтворити USB","режим USB"

#define SYS_MUSIC_APP_SD_UK \
    "відтворити карту SD","відтворити карту TF","режим SD","режим TF"

#define SYS_MUSIC_APP_BT_UK \
    "режим Bluetooth","відтворювати через Bluetooth"

#define SYS_MUSIC_APP_AUX_UK \
    "режим лінійного входу","режим AUX"

//=================闹钟指令=====================//
#define SYS_ALARM_DEL_UK \
    "видалити будильник","скасувати будильник","вимкнути будильник","видалити нагадування"

#define SYS_ALARM_DEL_ALL_UK \
    "видалити всі будильники","скасувати всі будильники","вимкнути всі нагадування"

#define SYS_ALARM_LOOK_UK \
    "переглянути будильники","які будильники налаштовані","відкрити сторінку будильників"

//=================音量调节指令=====================//
#define SYS_VOLUME_SET_UK  "налаштувати гучність на"

#define SYS_MUSIC_VOLUME_UK \
    "зменшити гучність","зробити музику тихішою", \
    "збільшити гучність","зробити музику голоснішою"

#define SYS_MUSIC_MAX_VOLUME_UK \
    "максимальна гучність","звук на максимум","найголосніший рівень"

#define SYS_MUSIC_MIN_VOLUME_UK \
    "мінімальна гучність","звук на мінімум","найтихіший рівень"

#endif
#endif // __UK_INSTRUCT_WORD_H__